In [36]:
import pandas as pd
import numpy as np
import os

In [37]:
my_header = ['a','b','c']
my_header

['a', 'b', 'c']

In [38]:
my_index_out = ['G1']*3 + ['G2']*3
my_index_out

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [39]:
my_index_in = [1,2,3]*3
my_index_in

[1, 2, 3, 1, 2, 3, 1, 2, 3]

In [40]:
my_index_zipped = list(zip(my_index_out, my_index_in)) #zip은 양쪽 값을 매치시켜 하나의 튜플로 만드는 함수
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [41]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [42]:
df = pd.DataFrame(np.random.randn(6,3), columns = my_header, index=my_index)
df

             a         b         c
G1 1 -1.186611  0.760200 -0.891037
   2  0.296106 -1.197865 -1.689603
   3 -1.463952 -0.236654 -0.884917
G2 1 -2.207180 -0.926294  0.040412
   2  0.864805  0.225930  1.080823
   3  0.682325  0.197800 -0.896521

In [43]:
df['a']

G1  1   -1.186611
    2    0.296106
    3   -1.463952
G2  1   -2.207180
    2    0.864805
    3    0.682325
Name: a, dtype: float64

In [44]:
df['b']

G1  1    0.760200
    2   -1.197865
    3   -0.236654
G2  1   -0.926294
    2    0.225930
    3    0.197800
Name: b, dtype: float64

In [45]:
#행을 가져오기
df.loc['G1']

          a         b         c
1 -1.186611  0.760200 -0.891037
2  0.296106 -1.197865 -1.689603
3 -1.463952 -0.236654 -0.884917

In [46]:
df.loc['G1'].loc[1]

a   -1.186611
b    0.760200
c   -0.891037
Name: 1, dtype: float64

In [47]:
df.loc['G2'].loc[1, 'b']

-0.9262941611544568

In [48]:
df = pd.DataFrame(np.random.randn(3,6), columns = my_index, index=my_header)
df

         G1                            G2
          1         2         3         1         2         3
a  1.868858  1.985503 -0.939845  1.163520 -0.064369 -0.602791
b -0.814643 -2.551429  1.110349  0.006922 -0.612973 -0.411905
c  0.667900  0.742070 -0.154124  0.743614 -0.605147 -0.489218

In [49]:
df['G2']

          1         2         3
a  1.163520 -0.064369 -0.602791
b  0.006922 -0.612973 -0.411905
c  0.743614 -0.605147 -0.489218

In [69]:
import csv
df = pd.read_csv(r'C:\Users\hoins\Desktop\data_studentlist_en.csv')

In [74]:
df[df.gender=='M'].height.mean()

172.41

In [78]:
df[df.gender=='F'].height.mean()

166.64285714285714

In [84]:
df.groupby('gender')[height].mean()

NameError: name 'height' is not defined

In [85]:
df.groupby('gender').mean()

              age     grade      height     weight
gender
F       21.857143  1.714286  166.642857  50.442857
M       22.700000  2.700000  172.410000  68.500000

In [86]:
df.groupby('gender')[['height','weight']].mean()

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [87]:
dfr = df.groupby(['gender', 'bloodtype'])[['height','weight']].mean()
dfr

                      height     weight
gender bloodtype
F      A          172.450000  52.250000
       AB         170.100000  53.000000
       B          158.200000  45.200000
       O          164.433333  50.133333
M      A          165.700000  58.750000
       AB         181.050000  80.750000
       B          174.550000  68.950000
       O          166.200000  65.100000

In [90]:
dfr.loc['M'].loc['O']

height    166.2
weight     65.1
Name: O, dtype: float64

In [89]:
dfr.loc['F'].loc['AB'].height

170.1

In [ ]:
df.height.sort_values(ascending=False).reset_

In [92]:
df.bloodtype

0      O
1     AB
2      B
3     AB
4      A
5      O
6      O
7      A
8      B
9      B
10     O
11    AB
12     A
13     O
14     B
15     B
16     A
Name: bloodtype, dtype: object

In [94]:
df.bloodtype.unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [95]:
df.bloodtype.value_counts()

O     5
B     5
A     4
AB    3
Name: bloodtype, dtype: int64

In [97]:
df.bloodtype.mode()

0    B
1    O
dtype: object

In [99]:
df.gender.mode()

0    M
dtype: object

In [102]:
df.sort_values(by='age', ascending=False)

                name gender  age  grade absence bloodtype  height  weight
2       Brian Martin      M   24      4       N         B   175.0    80.1
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
8       John Bertsch      M   23      3       N         B   178.5    64.2
3       David Hassel      M   23      3       N        AB   182.1    85.7
6        Susan Clark      F   22      1       N         O   155.2    45.3
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
11      John Matsuda      M   22      2       N        AB   180.0    75.8
14      Linda Carter      F   22      2       N         B   158.2    45.2
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
16      Andrew Daley      M   21      1       N         A   169.2    62.2
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [108]:
# SELECT * FROM df ORDER BY bloodtype desc, age
df.sort_values(by=['bloodtype','age'], ascending=[True,False])

                name gender  age  grade absence bloodtype  height  weight
7    Margareth Jones      F   23      1       N         A   176.9    55.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
16      Andrew Daley      M   21      1       N         A   169.2    62.2
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
3       David Hassel      M   23      3       N        AB   182.1    85.7
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
2       Brian Martin      M   24      4       N         B   175.0    80.1
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
14      Linda Carter      F   22      2       N         B   158.2    45.2
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
6        Susan Clark      F   22      1       N         O   155.2    45.3
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0

# PIVOT TABLE

In [109]:
df.groupby('gender')[['height']].mean()

            height
gender
F       166.642857
M       172.410000

In [111]:
pd.pivot_table(df, index = ['gender'], values = ['height'], aggfunc = np.mean)

            height
gender
F       166.642857
M       172.410000

In [112]:
pd.pivot_table(df, index = ['gender'], values = ['height'])

            height
gender
F       166.642857
M       172.410000

In [113]:
pd.pivot_table(df, index = ['gender'], values = ['height', 'weight'], aggfunc = np.mean)

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [115]:
pd.pivot_table(df, index = ['gender', 'bloodtype'], values = ['height'], aggfunc = np.mean)

                      height
gender bloodtype
F      A          172.450000
       AB         170.100000
       B          158.200000
       O          164.433333
M      A          165.700000
       AB         181.050000
       B          174.550000
       O          166.200000

In [116]:
pd.pivot_table(df, index = ['gender'], columns =  ['bloodtype'], values = ['height'], aggfunc = np.mean)

           height
bloodtype       A      AB       B           O
gender
F          172.45  170.10  158.20  164.433333
M          165.70  181.05  174.55  166.200000

In [117]:
pd.pivot_table(df, index = ['gender'], values = ['height', 'weight'], aggfunc = np.median)

        height  weight
gender
F        168.0    52.0
M        172.1    66.2

In [119]:
pd.pivot_table(df, index = ['gender'], values = ['height', 'weight'], aggfunc = {'height':np.mean, 'weight':np.median})

            height  weight
gender
F       166.642857    52.0
M       172.410000    66.2

index, columns: A, B, C

values : D, E

In [121]:
dfr = pd.pivot_table(df, index=['A', 'B'], values=['D','E'], aggfunc={'D':np.mean, 'E':np.median})

KeyError: 'D'

In [122]:
df.absence.value_counts()

N    13
Y     4
Name: absence, dtype: int64

In [123]:
df.absence.mode()

0    N
dtype: object

In [124]:
df.absence.unique()

array(['Y', 'N'], dtype=object)

In [125]:
df.bloodtype.unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [126]:
df.bloodtype.nunique()

4

In [127]:
df.bloodtype

0      O
1     AB
2      B
3     AB
4      A
5      O
6      O
7      A
8      B
9      B
10     O
11    AB
12     A
13     O
14     B
15     B
16     A
Name: bloodtype, dtype: object